tutorials/multiphase/compressibleInterDyMFoam/laminar/sphereDrop/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    innerAMI
    {
        type            cyclicAMI;
        value           uniform 300;
    }

    outerAMI
    {
        type            cyclicAMI;
        value           uniform 300;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    bottom
    {
        type            zeroGradient;
    }

    farFieldWall
    {
        type            zeroGradient;
    }

    sphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
